load-test/test-script.level-1.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://scheduler:3000
  phases:
    - name: Warm up phase
      duration: 30
      arrivalRate: 10
      rampTo: 10
    - name: Ramp up load
      duration: 30
      arrivalRate: 10
      rampTo: 50
    - name: Spike phase
      duration: 30
      arrivalRate: 50
      rampTo: 300
    - name: Sustain load
      duration: 180
      arrivalRate: 300
scenarios:
  - name: Create a new task
    flow:
      - post:
          url: "/v1.0/managements/tasks"
          json:
            tasks:
              - payload:
                  stepId: 11