load-test/test-script.level-5.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://scheduler:3000
  phases:
    - name: Warm up phase
      duration: 60
      arrivalRate: 10
      rampTo: 100
    - name: Ramp up load
      duration: 240
      arrivalRate: 100
      rampTo: 400
    - name: Spike phase
      duration: 240
      arrivalRate: 400
      rampTo: 900
    - name: Sustain load
      duration: 300
      arrivalRate: 900
scenarios:
  - name: Create a new task
    flow:
      - post:
          url: "/v1.0/managements/tasks"
          json:
            tasks:
              - payload:
                  stepId: 11