load-test/test-script.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://scheduler:3000
  phases:
    - name: Warm up phase
      duration: 5
      arrivalRate: 1
      rampTo: 5
    - name: Ramp up load
      duration: 10
      arrivalRate: 5
      rampTo: 10
    - name: Spike phase
      duration: 30
      arrivalRate: 10
      rampTo: 30
scenarios:
  - name: Create a new task
    flow:
      - post:
          url: "/v1.0/managements/tasks"
          json:
            tasks:
              - payload:
                  stepId: 11